{
    "sample1": "No es nuevo que me evado de la realidad dejando que mi imaginación mezcle mundos diferentes para inventar otros incluso más absurdos que el nuestro. Así que al final he tenido que terminar admitiendo que...\n\n …A veces, a menudo, me cansa todo el mundo este de JavaScript. Quizá no es sólo JS, quizá es todo lo que tiene que ver con desarrollo de software. Pero sí que es especialmente la comunidad de JavaScript. A ver, reconozco que a veces me parece un sujeto de observación en ciertas formas fascinante, por muchos de los absurdos a los que llegan, pero la mayoría de las veces sólo me cansa. Me agota incluso.\n\n Por otra parte, sin ninguna relación en absoluto con lo anterior, a veces también me fascinan ciertas películas ochenteras (lo que incluye películas de los ochenta y películas que no son de los ochenta pero comparten ciertos rasgos). Hay muchas temáticas de películas que me gustan. Hay una ambientación que no necesariamente me gusta de una forma especial, pero me interesa. Son esas pelis suburbanas, generalmente ambientadas en Nueva York, aunque a veces en otra “gran ciudad”… pelis “de bandas”. Pero hay como dos subgéneros. Por un lado están las películas realmente de bandas, vistas como delincuentes callejeros, bandas violentas… The Warriors es quizá un buen ejemplo, porque no tiene mucho argumento, sólo es una especie de “retrato de tribus” y peleas. También es un buen ejemplo por otro motivo, pero antes… Por otro lado están las películas musicales como Calles de Fuego (curiosamente del mismo director que la anterior) o, y esta es mejor ejemplo, Breakin' (y su inmediata secuela). Estas también son en mayor o menor medida películas de bandas callejeras. Incluso podría incluir aquí el videoclip de Beat it.\n\n La gracia de estas películas, de las musicales (pero de las que tienen buena música, eh) y de las otras también, es que en esa época, incluso las más “crudas”, las que luego producían vandalismo callejero, como The Warriors, tienen una violencia muy poco realista. Es como un gradiente de fantasía que podría ir del enfrentamiento meramente musical de Breakin' al falsamente realista de The Warriors. “Falsamente”, porque… a ver, Baseball Furies. No sé si necesito señalar que van maquillados y vestidos de jugadores de béisbol, pero si hace falta lo señalo, eh. O quizá es el videoclip de Beat It el más representativo de esa “violencia de coreografía” que subyuga la violencia con baile y hereda tan obviamente de West Side Story y otros similares.\n\n Oh, bueno, el caso es que me gustan esas películas -las que son buenas y las que no lo son tanto- en parte por ese intento de ser “crudas” pero tampoco demasiado, no nos pasemos. O al revés, intento de ser alegremente musicales pero con un toque edgy, un toque de chico “peligroso”.\n\n Me canso, me agoto, me aburro de las tonterías de React, Ember, Angular, Vue, Backbone, Knockout, Meteor, Dojo, Polymer, Aurelia… De todos los personajes y personajillos, del TC39, de MadridJS… De React, Preact, Inferno, React Lite, Redux, Reflux, Mobx… De conferencias internacionales, de conferencias locales… También de CSS, LESS, SASS, BEM, OOCSS, SMACSS, 7-in-1, y qué-sé-yo.\n\n Y entonces dos mundos chocan.\n\n Y empiezo a imaginarme a todos esos grupos y personas como a bandas callejeras con uniformes pintorescos, unos vestidos de payasos, otros de fontaneros punks o de niñas de colegio bien pero que “mastican chicle agresivamente” y probablemente llevan navajas. Y no son realmente bandas, sino que hacen de bandas. Es todo una coreografía de peleas musicales que quieren parecer duras y agresivas pero son, más que nada, ridículas.\n\n Me los imagino así, realmente. Los visualizo. Veo a ese tipo que pretende meter un nuevo elemento de sintaxis en el estándar porque, básicamente, le mola. Le veo en un callejón humeante con tres más todos con crestas de colores y chupas fucsia eléctrico pele-bailando contra esos otros fans que no paran de hablar de ese framework todo el día y que van vestidos de apaches o de colegialas malas o de macarras de cuero negro y cadenas o chinos con inevitables dragones dibujados en la espalda.\n\n Los imagino con sus absurdas peleas. ¡Cuidado! ¡Un Vuente se ha metido sin querer en territorio de los Reactos! ¡Y los Acute Angulars han atacado paquete de NPM de los Plastic Polymerics!\n\n No sé si intentan llegar a Coney Island o quieren ser aclamados como los mejores bailarines de break-dance del barrio. Pero los imagino y, de alguna forma, no sé si por dejar en evidencia el absurdo y la falta de sentido o sólo porque mi cerebro se relaja así, pero todo se hace un poco más soportable. No mucho; pero un poco sí.\n"
}
